Repository: tranthienducc/Todo-App-Flutter
Catalog: lib/l10n/app_*.arb
Languages: vi

source: List Folders
vi: Danh sách thư mục

source: All
vi: Tất cả

source: Create Folder
vi: Tạo thư mục

source: Edit Folder
vi: Chỉnh sửa thư mục

# editFolderSuccess
source: Edit folder successfully
vi: Chỉnh sửa thư mục thành công

source: Setting
vi: Thiết lập

source: Create New Folder
vi: Tạo thư mục mới

# placeholderFolder
source: Folder Name
vi: Tên thư mục

source: Select Icon
vi: Chọn biểu tượng

source: Select folder
vi: Chọn thư mục

source: Enter note
vi: Nhập ghi chú

source: Add
vi: Thêm

source: Select Color
vi: Chọn màu sắc

source: Cancel
vi: Trở về

source: Create
vi: Tạo

source: Save
vi: Lưu

source: Delete Folder
vi: Xóa thư mục

# confirmDeleteFolder
source: Are you sure you want to delete this folder?
vi: Bạn có chắc chắn muốn xóa thư mục này không?

source: Delete
vi: Xóa

# exportExcel
source: Export to Excel
vi: Xuất ra Excel

source: Tasks
vi: Công việc

source: Late
vi: Trễ hạn

source: Today
vi: Hôm nay

source: Done
vi: Đã xong

source: Sort by Status
vi: Sắp xếp theo trạng thái

source: Sort by Update Time
vi: Sắp xếp theo thời gian cập nhật

source: Status:
vi: Trạng thái:

source: Last Edit:
vi: Chỉnh sửa lần cuối:

# notEditYet
source: No edits yet
vi: Chưa có chỉnh sửa

source: Delete Task
vi: Xóa công việc

# confirmDeleteTask
source: Are you sure you want to delete this task?
vi: Bạn có chắc chắn muốn xóa công việc này không?

# warningDelete
source: Folder "{folderTitle}" has tasks. Please delete all tasks before deleted folder
vi: Thư mục "{folderTitle}" còn chứa task. Vui lòng xoá hết task trước khi xoá thư mục.

# deleteFolderSuccess
source: Delete "{folderTitle}" successfully.
vi: Đã xóa thư mục "{folderTitle}".

# deleteTasksSuccess
source: Delete task "{taskTitle}" successfully.
vi: Đã xóa công việc "{taskTitle}".

source: Move task to folder
vi: Di chuyển tới thư mục

# emtyFolderToMove
source: No folder to move task
vi: Không có thư mục nào để di chuyển

# hasMoveToFolder
source: Công việc đã được di chuyển đến thư mục Task has been moved to folder "{targetFolderTitle}"
vi: Công việc đã được di chuyển đến thư mục "{targetFolderTitle}"

source: New Task
vi: Tạo công việc

source: Edit Task
vi: Chỉnh sửa công việc

# planing
source: What are you planing?
vi: Bạn đang có kế hoạch gì?

source: Add note
vi: Thêm ghi chú

source: Select status
vi: Chọn trạng thái

# warningContentTask
source: You have input content task before create.
vi: Bạn phải nhập nội dung công việc trước khi tạo.

# emtyTask
source: No task found.
vi: Không có task ở đây, hãy tạo task mới

# exportExcelSuccess
source: Export file folder and task successfully.
vi: Xuất thư mục và công việc thành công.

# exportExcelFailed
source: Failed to export folder and task
vi: Xuất thư mục và công việc thất bại.

# errorExportExecl
source: Cannot create file excel.
vi: Không thể tạo file excel.

source: Not found folder!
vi: Không tìm thấy thư mục

# emtyTaskExport
source: No task found to export
vi: Không có công việc nào được xuất

# notAccessFolder
source: Cannot access folder saved
vi: Không thể truy cập thư mục lưu trữ

# taskHasbeenMove
source: Task has been move to folder "{targetFolderTitle}"
vi: Công việc đã được di chuyển đến thư mục "{targetFolderTitle}"

# sampleFileExcel
source: Folder sample excel created at "{sampleFilePath}"
vi: Thư mục excel mẫu được tạo tại "{sampleFilePath}"

# notFoundFolderFileExcel
source: No folders found in the Excel file
vi: Không tìm thấy thư mục trong thư mục excel

# importFolder
source: Imported "{newFoldersLength}" folder
vi: Nhập "{newFoldersLength}" thư mục

source: Import Excel
vi: Nhập Excel

# notifications
source: Notification
vi: Thông báo

source: Exit
vi: Thoát

source: Menu
vi: Danh mục

# selectFolderAndTask
source: Select folder and task to export excel
vi: Chọn folder hoặc task để xuất excel

# selectTaskTo
source: Select task to "{selectedFolderTitle}" :
vi: Chọn thư mục từ "{selectedFolderTitle}" :

source: Select task:
vi: Chọn thư mục:
